# GetFailuresAccessor Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresProcessingEventArgs..::..GetFailuresAccessor Method
FailuresProcessingEventArgs Class See Also
---
Provides access to the failure information in the document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailuresAccessor GetFailuresAccessor()
```

Visual Basic
---
```text
Public Function GetFailuresAccessor As FailuresAccessor
```

Visual C++
---
```text
public:
FailuresAccessor^ GetFailuresAccessor()
```

# ### Return Value
The accessor to the failures in the document.
# See Also
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace